// JScript
var msg = new Array();

//共通 
msg[0]=new Array(
		"更新成功。",				         //0
		"更新失败。",				         //1
		"插入成功。",				         //2
		"插入失败。",				         //3
		"开始日期不能为空。",			     //4
		"结束日期不能为空。",   		     //5 
		"开始日期必须小于或等于结束日期。",  //6
		"导入成功！",				         //7
		"导入失败！",				         //8
		'您的ID没有权限访问此页面！'		 //9
);		
//员工信息 一览&详细
msg[1]=new Array(
		"员工编号长度不正确。",				//0
		"员工姓名长度不正确。"				//1
);

//考勤管理 --加班出勤统计
msg[4]=new Array(
		"查询年月不能为空。",				   //0
		"查询年月必须输入yyyy/mm型数字。",	   //1
		"部门编号不能为空 ",                  //2
		"部门编号只能为字母数字和下划线 ",    //3
		"部门名不能为空 ",                    //4
		"请输入正确的汉字 "                //5	
);

//系统管理--用户权限删除 liuyb
msg[2]=new Array(
		"删除成功。",				//0
		"此用户无权限记录。",		//1
		"删除失败。",				//2
		"分配成功。",				//3
		"分配失败。"				//4
);

//休假管理--年假查询	liuyb
msg[6]=new Array(
		"年份不能为空。",				   //0
		"年份必须输入4位数字。"			   //1
);

//合同续签管理
msg[3]=new Array(
		"续签成功。",   		            //0
		"续签失败。"                        //1
);
//系统管理--职务设置	liuyb
msg[7]=new Array(
		"职务编号不能为空。",			   //0
		"职务编号不能大于20位字符。",	   //1
		"职务名称不能为空。",			   //2
		"职务名称不能大于20位字符。",	   //3
		"职务编号必须是字母或数字。"	   //4
);

//系统管理--用户权限	liuyb
msg[8]=new Array(
		"密码不一致，请重新输入。",		 //0
		"登录ID不能为空。",			   //1
		"登录ID不能大于20位字符。",	   //2
		"用户名不能为空。",			   //3
		"用户名不能大于20位字符。",	   //4
		"密码不能为空。",			   //5
		"密码不能大于20位字符。",	   //6
		"确认密码不能为空。",			//7
		"确认密码不能大于20位字符。",	//8
		"登录ID只能为数字。"			//9
);

//离职登记--离职登记新增	liuyb
msg[10]=new Array(
		"备注不能大于50位字符。",		 //0
		"离职日期不能为空。"			 //1
);

//休假管理--休假登记一览	liuyb
msg[11]=new Array(
		"日期不能为空。",				//0
		"休假日期与天数不符合。",		//1
		"休假天数不能大于年假剩余。"	//2
);

//组织结构图	zhaokp
msg[9]=new Array(
		"请先做成组织结构图。"		 //0
);	
//员工详细	yuzp
msg[12]=new Array(
		"请输入员工编号。",		               //0
		"身份证号输入错误。",                  //1
		"邮编长度输入错误。",                  //2
		"入社前工龄为1位或2位数字构成。",      //3
		"姓名输入长度错误。",                  //4
		"请输入员工姓名。"                     //5
		
);	

//              HanJZ
msg[13]=new Array(
		"此数据已存在。",                                                    //0
		"请选择评价区分。",  	                                             //1
		"确定要关闭吗？",                                                    //2
		"该员工当日已进行过评价！",                                          //3
		"确定要评价吗？",                                                    //4
		"备注长度不能超过25个文字",                                          //5
		"请选择要进行工程分配的员工信息 ",                                   //6
		"请选择要分配的工程！",                                              //7
		"确定要将员工分配到此工程么? ",                                      //8
		"请先选择工程！",                                                    //9
		"请先查询到要打印的数据 ",                                           //10
		"请输入要查询的编号 ",                                               //11
		"编号必须为数字 ",                                                   //12
		"请输入查询月份 ",                                                   //13
		"请选择签订日期 ",                                                   //14
		"请输入合同期 ",                                                     //15
		"合同期请输入整数 ",                                                 //16
		"续签的开始日期不能小于上个合同的结束日期，请重新选择签订日期！",    //17
		"确定要续签吗？",                                                    //18
		"请选择要批量续签的信息 ",                                           //19
		"确定要批量续签吗? ",                                                //20
		"请输入结束年月！",                                                  //21
		"确定要保存此备注么？ ",                                             //22
		"请填写备注信息！",                                                  //23
		"开始日期不能大于结束日期 ",                                         //24
		"请输入查询年月 ",                                                   //25
		"编号必须为数字 ",                                                   //26
		"请选择变更日期 ",                                                   //27
		"请选择职务 ",                                                       //28
		"确定要变更吗？ ",                                                   //29
		"熟练度只能为整数或小数 ",                                           //30
		"不能对已录用员工执行此操作 ",                                       //31
		"请选择要判定为 ",                                                   //32
		"的应聘人员信息 ",                                                   //33
		"确定要进行 ",                                                       //34
		"的应聘人员信息 ",                                                   //35
		"上班开始时间不能大于下班时间 ",                                     //36
		"请输入用户名 ",                                                     //37
		"请输入密码 "                                                        //38
		
		
);

//考勤管理--补录考勤数据	liuyb
msg[14]=new Array(
		"编号不能为空。",			 //0
		"卡号不能为空。",			 //1
		"日期不能为空。",			 //2
		"开始时间不能为空。",		//3
		"结束时间不能为空。",		//4
		"开始时间格式不正确。",		//5
		"结束时间格式不正确。"		//6
);

//离职管理--离职考勤查询	liuyb
msg[15]=new Array(
		"查询月份不能为空。",			 //0
		"查询年月必须输入yyyy/mm型数字。"		 //1
);

//系统管理--保有工数熟练度设置	liuyb
msg[16]=new Array(
		"熟练度长度不能大于4位字符。",			//0
		"熟练度只能为数字。"					//1
);
//半年出勤统计    yuzhongpeng
msg[17]=new Array(
		"请输入正确的日期格式"       //0
);


//考勤管理--补录考勤数据	liuyb
msg[18]=new Array(
		"评价日期与评价区分不可为空！",	    //0
		"评价日期不可为空！",			    //1
		"评价区分不可为空！",			    //2
		"该日已评价成功！"     	            //3
);


//Msg取得
function getMsg(s,t) {
    return msg[s][t];
}
